Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/arrests/questioning_and_surveillance.html.txt.tmx
Source language: en
Languages: ga

source: When the Gardaí are investigating and detecting crime they are entitled to observe the actions of any individual
ga: Nuair atá an Garda Síochána i mbun imscrúdaithe agus ag brath coireanna, tá siad i dteideal breathnú ar ghníomhartha aon duine ar leith

source: However the Gardaí must, stay within the confines of the law when questioning members of the public
ga: Ní mór do na Gardaí, áfach, fanacht taobh istigh de chríocha an dlí nuair atá baill den phobal á gceistiú acu

source: To do this, the Gardaí are given certain powers to stop and question the public
ga: Ionas gur féidir leo é seo a dhéanamh, tá cumhachtaí áirithe tugtha do na Gardaí chun baill den phobal a stopadh agus a cheistiú

source: Where a Garda is investigating a criminal offence, the Garda is entitled to seek the co-operation of anyone by asking the person questions about what he/she saw or heard
ga: Nuair atá Garda ag imscrúdú cion coiriúil, tá an Garda i dteideal comhoibriú a lorg ó dhuine ar bith trí cheisteanna a fhiafrú den duine faoina bhfaca nó faoinar chuala sé/sí

source: However, while the Gardaí are entitled to question members of the public, there is no legal obligation to answer any such questions or to co-operate with the Gardaí
ga: Cé go bhfuil na Gardaí i dteideal ceisteanna a chur ar bhaill den phobal, áfach, níl aon oibleagáid dlíthiúil ann a leithéid de cheisteanna a fhreagairt ná comhoibriú leis na Gardaí

source: Most of the powers given to the Gardaí to stop and question members of the public are set out in law (known as statutory powers)
ga: Tá formhór na gcumhachtaí a thugtar do na Gardaí chun baill den phobal a stopadh agus a cheistiú leagtha síos sa dlí (tugtar cumhachtaí reachtúla orthu seo)

source: There are, however, a number of instances where a Garda is entitled to stop and question you where no statutory power exists
ga: Tá roinnt cásanna, áfach, ina bhfuil Garda i dteideal tú a stopadh agus a cheistiú ach nach bhfuil aon chumhacht reachtúil ann ina leith

source: This is known as a common law power
ga: Tugtar cumhacht dlí coiteann air seo

source: An example of this would be where a Garda observes you acting suspiciously late at night, in an area where a lot of crimes are being committed
ga: Sampla de seo ná má thugann Garda faoi deara go bhfuil rud éigin amhrasach faoi do ghníomhartha go deireanach san oíche, i gceantar ina bhfuil go leor coireanna ar bun

source: The Garda is entitled to stop you in order to detect and prevent crime
ga: Tá an Garda i dteideal tú a stopadh chun coir a bhraitheadh agus a sheachaint

source: You are under no legal obligation to co-operate with the Garda and the Garda cannot use force to restrain your freedom under common law, short of arresting you
ga: Níl aon oibleagáid dlíthiúil ort comhoibriú leis an nGarda, agus ní féidir leis an nGarda fórsa a úsáid chun do shaoirse a shrianú faoin dlí coiteann, seachas tú a ghabháil

source: However, if the Garda has reasonable grounds for suspecting that you committed an offence, the Garda can use a statutory power to demand your name and address
ga: Má tá foras réasúnta ag an nGarda a cheapadh go bhfuil coir déanta agat, is féidir leis an nGarda cumhacht reachtúil a úsáid chun d'ainm agus do sheoladh a iarraidh

source: If you refuse to provide them, then the Garda can arrest you
ga: Má dhiúltaíonn tú iad a thabhairt, is féidir leis an nGarda tú a ghabháil ansin

source: The Gardaí have a common law power to stop motorists at random in order to detect and prevent crime
ga: Tá cumhacht dlí coiteann ag na Gardaí chun tiománaithe a stopadh go randamach chun coir a bhrath agus a sheachaint

source: This power can be used, for example, to stop cars near pubs to identify drunk drivers or in order to check cars passing through an area where a lot of crime had been committed
ga: Is féidir an chumhacht seo a úsáid, mar shampla, chun carranna a stopadh gar do thithe tábhairne chun tiománaithe atá ar meisce a aithint nó chun carranna atá ag dul trí cheantar ina bhfuil go leor coireanna déanta a sheiceáil

source: As outlined above, a Garda is entitled to stop a motorist under common law for the purpose of detecting and preventing crime
ga: Mar a leagtar síos thuas, tá Garda i dteideal tiománaí a stopadh faoin dlí coiteann chun coir a bhrath agus a sheachaint

source: The Garda is also entitled to stop a motorist under a statutory power given under Section 109 of the Road Traffic Act 1961, which obliges a motorist to stop his/her vehicle when required to do so by a Garda
ga: Tá an Garda i dteideal tiománaí a stopadh faoi chumhacht reachtúil atá tugtha faoi Alt 109 den Acht um Thrácht ar Bhóithre 1961, a chuireann an dualgas ar thiománaí a f(h)eithicil a stopadh nuair a iarrann Garda air/uirthi é sin a dhéanamh

source: This statutory power is given to the Gardaí for the purpose of inspecting vehicle tax, insurance certificates, driving licenses and road worthiness of vehicles
ga: Tugtar an chumhacht reachtúil seo do na Gardaí chun cáin fheithicil, teastais árachais, ceadúnais tiomána agus ród-acmhainneachta feithiclí a scrúdú

source: Unlike common law power, it is confined to road traffic offences
ga: Tá sé teoranta do chiontaí trácht bóithre, rud nach bhfuil fíor faoin gcumhacht dlí coiteann

source: There are a considerable number of statutory provisions which allow the Gardaí to stop anyone for certain purposes, but there is only one which specifically permits a Garda to stop and question someone, short of arresting the person
ga: Tá líon suntasach cumhachtaí reachtúla ann a cheadaíonn do na Gardaí daoine a stopadh ar chúiseanna ar leith, ach níl ach ceann amháin a thugann cead ar leith do Gharda duine a stopadh agus a cheistiú, gan an duine a ghabháil

source: Section 30 of the Offences Against the State Act 1939 allows a Garda to stop and interrogate anyone whom the Garda suspects of having committed or being about to commit an offence under the 1939 Act or an offence scheduled for the purposes of the Act
ga: Tugann Alt 30 den Acht um Chionta in aghaidh an Stáit 1939 cead do Gharda duine ar bith a stopadh agus a cheistiú má cheapann an Garda go bhfuil coir déanta acu nó go bhfuil siad ar tí coir a dhéanamh faoi Acht 1939, nó coir atá sceidealta chun críocha an Achta

source: (There are a number of offences listed as being scheduled offences, such as, firearms offences and explosive offences)
ga: (Tá roinnt cionta liostáilte mar chiontaí sceidealta, mar shampla, cionta arm tine agus cionta pléascáin)

source: This gives the Gardaí the power to stop a suspect in a public place
ga: Tugann sé seo an chumhacht do na Gardaí duine atá faoi amhras a stopadh in áit phoiblí

source: It also gives them the power to stop any vehicle, or any ship, boat or other vessel for the purposes of questioning and searching, and if necessary, arresting the suspect
ga: Tugann sé an ceart dóibh freisin aon fheithicil, nó aon long, aon bhád nó aon soitheach eile a stopadh chun an duine atá faoi amhras a cheistiú, a chuardach, agus, más gá, a ghabháil

source: It is commonplace for the Gardaí to use surveillance on people and locations in their efforts to detect and prevent crime
ga: Is gnáthrud do na Gardaí faireachas a úsáid ar dhaoine agus ar shuíomhanna ina n-iarrachtaí coireanna a bhraith agus a chosc

source: Surveillance is used in a number of situations
ga: Úsáidtear faireachas i roinnt staideanna éagsúla

source: If, for example, you are suspected of being involved in criminal activities you may be placed under surveillance
ga: Mar shampla, má tá amhras ann go bhfuil baint agatsa le gníomhartha coiriúla, d'fhéadfadh sé go ndéanfaí faireachas ort

source: Similarly, when the Gardaí have information that a crime is to be committed at a certain place they may decide to place that premises or location under surveillance
ga: Mar an gcéanna, nuair atá faisnéis ag na Gardaí go bhfuil coir chun tarlú ag áit ar leith, b'fhéidir go socróidh siad faireachas a dhéanamh ar an áitreabh nó an suíomh sin

source: The decision to place a person or premises under surveillance is primarily one for the Gardaí but must be made within the law
ga: Is faoi na Gardaí den chuid is mó atá an cinneadh faireachas a dhéanamh ar dhuine nó ar áitreabh, ach caithfear an cinneadh seo a dhéanamh taobh istigh den dlí

source: Everyone in Ireland enjoys the freedom to observe the movements of others and, indeed, to observe the property of others
ga: Tá an saoirse ag gach duine in Éirinn gluaiseachtaí dhaoine eile a thabhairt faoi deara, agus, go deimhin, maoin dhaoine eile a thabhairt faoi deara

source: While this is true, the manner of such observations cannot be such as to cause alarm or distress to another person
ga: Cé go bhfuil an méid sin fíor, ní féidir an faire seo a dhéanamh ar bhealach a chuirfidh imní nó tochsal ar dhuine eile

source: Section 10 of the Non-fatal Offences Against the Persons Act 1997 protects you from being stalked or harassed
ga: Tugann Alt 10 den Acht um Chionta Neamh-Mharfacha in Aghaidh an Duine 1997 cosaint duit ó stalcaireacht nó ciapadh

source: While such protection exists, it is unlikely that this protection could be used to stop Garda surveillance since you would not normally be aware that the Gardaí have you under surveillance
ga: Cé go bhfuil a leithéid seo de chosaint ann, ní dócha go bhféadfaí an chosaint seo a úsáid chun stop a chur le faireachas na nGardaí, os rud é nach iondúil go mbeadh a fhios agat go bhfuil faireachas á dhéanamh ort

source: Another protection you have with regard to surveillance is the constitutional right to privacy which is a fundamental right of everyone
ga: Ceart eile atá agat i leith fhaireachas ná an ceart chun príobháideachta atá agat faoin mbunreacht, atá ina cheart bunúsach ag gach duine

source: The possible breach of this right to privacy relates to surveillance being carried out by neighbours, husbands or wives, private investigators or stalkers
ga: Baineann an sárú a d'fhéadfaí a dhéanamh ar an gceart chun príobháideachta seo le faireachas atá á dhéanamh ag comharsana, mná nó fir céile, imscrúdaitheoirí príobháideacha nó stalcaire

source: The courts have not shown any willingness to use this protection in cases where the surveillance was being conducted by the Gardaí in the investigation, detection and prevention of crime
ga: Níor thaispeáin na cúirteanna aon toilteanas go dtí seo maidir leis an gcosaint seo a úsáid i gcásanna ina raibh an faireachas ar bun ag na Gardaí in imscrúdú, brath nó cosc coireanna

source: The Criminal Justice (Surveillance) Act 2009, which became law in July 2009, provides a statutory framework for evidence obtained by secret surveillance
ga: Forálann an tAcht um Cheartas Coiriúil (Faireachas) 2009, a tháinig an dlí i mí Iúil 2009, creat reachtúil ar fhianaise a fhaightear trí fhaireachas rúnda

source: It is intended that such surveillance be used to combat serious criminal, subversive or terrorist activity
ga: Tá sé i gceist go faireachas den sórt sin a úsáid chun dul i ngleic coiriúil tromchúiseach, gníomhaíocht threascrach nó sceimhlitheoireachta

source: The Act provides for a judicial authorisation procedure for surveillance and a complaints procedure
ga: Forálann an tAcht do nós imeachta údaraithe maidir le faireachas agus breithiúnach nós imeachta gearán

source: Interception of phone calls and packages
ga: Tascradh ar ghlaonna teileafóin agus pacáistí

source: Under the Interception of Postal Packets and Telecommunications Messages (Regulation) Act 1993 there are statutory provisions which give the Gardaí the power to use technology for the purpose of keeping people under surveillance
ga: Faoin Acht um Tascradh den Post-Phaicéid agus Teachtaireachtaí Teileachumarsáide (Rialáil) 1993, tá forálacha reachtúla ann a thugann an chumhacht do Ghardaí teicneolaíocht a úsáid chun faireachas a dhéanamh ar dhaoine

source: An example of this is the power given to the Gardaí to intercept a telephone call for the purpose of investigating criminal offences
ga: Sampla de seo ná an chumhacht a thugtar do na Gardaí glaoch teileafóin a thascradh chun imscrúdú a dhéanamh ar chionta coiriúla

source: This power is granted by the Minister for Justice and Equality
ga: Tá an chumhacht seo arna thabhairt ag an an Aire Dlí agus Cirt agus Comhionannais

source: The Minister may also authorise the interception and opening of postal letters and packages
ga: Is féidir leis an Aire údarú a thabhairt i gcomhair trascradh agus oscailt litreacha agus pacáistí poist freisin

source: Only the Garda Commissioner can apply for such authorisation in relation to criminal offences
ga: Ní féidir le haon duine ach Coimisinéir na nGardaí iarratas a dhéanamh ar údarú dá leithéid seo i leith chionta coiriúla

source: The Garda Commissioner and the Chief of Staff of the Defence Forces (Army) can apply for authorisation in relation to state security
ga: Is féidir le Coimisinéir na nGardaí agus le Ceann Foirne Óglaigh na hÉireann (an tArm) iarratas a dhéanamh ar údarú i leith slándáil an stáit

source: The operation of these intercepts is monitored by the President of the High Court who is responsible for ensuring the intercepts are confined to those which are authorised by the Minister
ga: Bíonn monatóireacht á dhéanamh ar oibriú na dtascradh seo ag Uachtarán na hArd-Chúirte, atá freagrach as a chinntiú go bhfuil siad teoranta dóibh siúd atá údaraithe ag an Aire

source: It is a criminal offence for someone to intercept a telephone call, letter or package addressed to someone else, without legal authorisation
ga: Is cion coiriúil é glaoch teileafóin, litir nó pacáiste le duine eile a thascradh, gan údarú dlíthiúil
